In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A -1.312206 -1.732775  0.019156 -2.099153
B  0.146828 -1.289927  0.102264  1.673175
C -1.131586  0.216459  0.940765 -0.253561
D -0.715227  0.507833  1.626840  2.140261
E  0.394393 -0.111948  0.372462  0.748667

In [5]:
df['W']

A    1.014586
B    1.141959
C    0.878447
D   -0.125982
E    0.126224
Name: W, dtype: float64

In [7]:
df[['W','Z']]

          W         Z
A  1.014586  0.218061
B  1.141959 -0.398077
C  0.878447 -0.257731
D -0.125982  0.969055
E  0.126224 -0.540901

In [9]:
type(df['W'])

pandas.core.series.Series

In [11]:
df['new']=df['W']+df['Y']
df

          W         X         Y         Z       new
A  1.014586  0.219250  0.001784  0.218061  1.016370
B  1.141959 -0.272762 -0.006151 -0.398077  1.135808
C  0.878447 -0.582115  0.286996 -0.257731  1.165443
D -0.125982  0.042962  1.991767  0.969055  1.865785
E  0.126224 -1.505324  1.049696 -0.540901  1.175920

In [13]:
df.drop('new',axis=1)

          W         X         Y         Z
A  1.014586  0.219250  0.001784  0.218061
B  1.141959 -0.272762 -0.006151 -0.398077
C  0.878447 -0.582115  0.286996 -0.257731
D -0.125982  0.042962  1.991767  0.969055
E  0.126224 -1.505324  1.049696 -0.540901

In [14]:
df.drop('E',axis=0)

          W         X         Y         Z       new
A  1.014586  0.219250  0.001784  0.218061  1.016370
B  1.141959 -0.272762 -0.006151 -0.398077  1.135808
C  0.878447 -0.582115  0.286996 -0.257731  1.165443
D -0.125982  0.042962  1.991767  0.969055  1.865785

In [15]:
df.loc['A']

W      1.014586
X      0.219250
Y      0.001784
Z      0.218061
new    1.016370
Name: A, dtype: float64

In [16]:
df.iloc[2]

W      0.878447
X     -0.582115
Y      0.286996
Z     -0.257731
new    1.165443
Name: C, dtype: float64

In [17]:
df.loc['B','Y']

-0.00615103489395384

In [18]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  1.014586  0.001784
B  1.141959 -0.006151

In [19]:
df

          W         X         Y         Z       new
A  1.014586  0.219250  0.001784  0.218061  1.016370
B  1.141959 -0.272762 -0.006151 -0.398077  1.135808
C  0.878447 -0.582115  0.286996 -0.257731  1.165443
D -0.125982  0.042962  1.991767  0.969055  1.865785
E  0.126224 -1.505324  1.049696 -0.540901  1.175920

In [20]:
df>0

       W      X      Y      Z   new
A   True   True   True   True  True
B   True  False  False  False  True
C   True  False   True  False  True
D  False   True   True   True  True
E   True  False   True  False  True

In [21]:
df[df>0]

          W         X         Y         Z       new
A  1.014586  0.219250  0.001784  0.218061  1.016370
B  1.141959       NaN       NaN       NaN  1.135808
C  0.878447       NaN  0.286996       NaN  1.165443
D       NaN  0.042962  1.991767  0.969055  1.865785
E  0.126224       NaN  1.049696       NaN  1.175920

In [22]:
df[df['W']>0]

          W         X         Y         Z       new
A  1.014586  0.219250  0.001784  0.218061  1.016370
B  1.141959 -0.272762 -0.006151 -0.398077  1.135808
C  0.878447 -0.582115  0.286996 -0.257731  1.165443
E  0.126224 -1.505324  1.049696 -0.540901  1.175920

In [24]:
df[df['W']>0]['Y']

A    0.001784
B   -0.006151
C    0.286996
E    1.049696
Name: Y, dtype: float64

In [26]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.001784  0.219250
B -0.006151 -0.272762
C  0.286996 -0.582115
E  1.049696 -1.505324

In [27]:
df[(df['W']>0)&(df['Y']>1)]

          W         X         Y         Z      new
E  0.126224 -1.505324  1.049696 -0.540901  1.17592

In [28]:
df

          W         X         Y         Z       new
A  1.014586  0.219250  0.001784  0.218061  1.016370
B  1.141959 -0.272762 -0.006151 -0.398077  1.135808
C  0.878447 -0.582115  0.286996 -0.257731  1.165443
D -0.125982  0.042962  1.991767  0.969055  1.865785
E  0.126224 -1.505324  1.049696 -0.540901  1.175920

In [29]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  1.014586  0.219250  0.001784  0.218061  1.016370
1     B  1.141959 -0.272762 -0.006151 -0.398077  1.135808
2     C  0.878447 -0.582115  0.286996 -0.257731  1.165443
3     D -0.125982  0.042962  1.991767  0.969055  1.865785
4     E  0.126224 -1.505324  1.049696 -0.540901  1.175920

In [30]:
newind='CA NY WY OR CO'.split()
df['States']=newind
df

          W         X         Y         Z       new States
A  1.014586  0.219250  0.001784  0.218061  1.016370     CA
B  1.141959 -0.272762 -0.006151 -0.398077  1.135808     NY
C  0.878447 -0.582115  0.286996 -0.257731  1.165443     WY
D -0.125982  0.042962  1.991767  0.969055  1.865785     OR
E  0.126224 -1.505324  1.049696 -0.540901  1.175920     CO

In [32]:
df.set_index('States',inplace=True)
df

               W         X         Y         Z       new
States
CA      1.014586  0.219250  0.001784  0.218061  1.016370
NY      1.141959 -0.272762 -0.006151 -0.398077  1.135808
WY      0.878447 -0.582115  0.286996 -0.257731  1.165443
OR     -0.125982  0.042962  1.991767  0.969055  1.865785
CO      0.126224 -1.505324  1.049696 -0.540901  1.175920

In [33]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [35]:
df=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.015848 -0.610528
   2  0.224711 -0.401524
   3 -1.968898 -0.454538
G2 1  0.415873 -0.833900
   2 -0.245141  0.590789
   3 -0.196039 -0.781918

In [36]:
df.loc['G1'].loc[1]

A    0.015848
B   -0.610528
Name: 1, dtype: float64

In [37]:
df.index.names

FrozenList([None, None])

In [38]:
df.index.names=['Group','Num']
df

                  A         B
Group Num
G1    1    0.015848 -0.610528
      2    0.224711 -0.401524
      3   -1.968898 -0.454538
G2    1    0.415873 -0.833900
      2   -0.245141  0.590789
      3   -0.196039 -0.781918

In [39]:
df.xs('G1')

            A         B
Num
1    0.015848 -0.610528
2    0.224711 -0.401524
3   -1.968898 -0.454538

In [41]:
df.xs(['G1',1])

A    0.015848
B   -0.610528
Name: (G1, 1), dtype: float64

In [42]:
df.xs(1,level='Num')

              A         B
Group
G1     0.015848 -0.610528
G2     0.415873 -0.833900

In [44]:
#SERIES
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [45]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [46]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [47]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [48]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [49]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [50]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [51]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [52]:
ser1=pd.Series([1,2,3,4],index=['USA','GERMANY','USSR','JAPAN'])
ser1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [53]:
ser2=pd.Series([1,2,5,4],index=['USA','GERMANY','ITALY','JAPAN'])
ser2

USA        1
GERMANY    2
ITALY      5
JAPAN      4
dtype: int64

In [54]:
ser1['USA']

1

In [55]:
ser1+ser2

GERMANY    4.0
ITALY      NaN
JAPAN      8.0
USA        2.0
USSR       NaN
dtype: float64

In [56]:
#MISSING DATA
df=pd.DataFrame({'A':[1,2,np.nan],
                'B':[5,np.nan,np.nan],
                'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [57]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [58]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [59]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [60]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [61]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [62]:
#GROUP BY
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [63]:
df.groupby('Company')

In [64]:
by_comp=df.groupby("Company")

In [65]:
by_comp

In [66]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [68]:
df.groupby("Company").mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [69]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [70]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [71]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [72]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [73]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [75]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [76]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [77]:
#operations
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [78]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [79]:
df['col2'].nunique()

3

In [81]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [83]:
newdf=df[(df['col1']>2)&(df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [84]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [85]:
del df['col1']

In [86]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz